[Killed] StringLiteral
src/logic.js:11:21
 
 const crypto = require("crypto");
 
-const VALID_CHARS = "ABCDEFGHJKLMNPQRSTUVWXYZ23456789";
+const VALID_CHARS = "";
 
 // ── Session code generator ────────────────────────────────────────────────────
killedBy: generateCode() returns exactly 6 characters
statusReason: RangeError: The value of "max" is out of range. It must be greater than the value of "min" (0). Received 0

[Killed] BlockStatement
src/logic.js:14:33
 const VALID_CHARS = "ABCDEFGHJKLMNPQRSTUVWXYZ23456789";
 
 // ── Session code generator ────────────────────────────────────────────────────
-function generateCode(sessions) {
-  if (!sessions) sessions = new Map();
-  let code = "";
-  for (let i = 0; i < 6; i++) {
-    code += VALID_CHARS[crypto.randomInt(0, VALID_CHARS.length)];
-  }
-  if (sessions.has(code)) return generateCode(sessions);
-  return code;
-}
+function generateCode(sessions) {}
 
 // ── Session create validation ─────────────────────────────────────────────────
killedBy: generateCode() returns exactly 6 characters
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] ConditionalExpression
src/logic.js:15:7
 
 // ── Session code generator ────────────────────────────────────────────────────
 function generateCode(sessions) {
-  if (!sessions) sessions = new Map();
+  if (false) sessions = new Map();
   let code = "";
   for (let i = 0; i < 6; i++) {
killedBy: generateCode() returns exactly 6 characters
statusReason: TypeError: Cannot read properties of undefined (reading 'has')

[Killed] BooleanLiteral
src/logic.js:15:7
 
 // ── Session code generator ────────────────────────────────────────────────────
 function generateCode(sessions) {
-  if (!sessions) sessions = new Map();
+  if (sessions) sessions = new Map();
   let code = "";
   for (let i = 0; i < 6; i++) {
killedBy: generateCode() returns exactly 6 characters
statusReason: TypeError: Cannot read properties of undefined (reading 'has')

[Killed] BlockStatement
src/logic.js:17:31
 function generateCode(sessions) {
   if (!sessions) sessions = new Map();
   let code = "";
-  for (let i = 0; i < 6; i++) {
-    code += VALID_CHARS[crypto.randomInt(0, VALID_CHARS.length)];
-  }
+  for (let i = 0; i < 6; i++) {}
   if (sessions.has(code)) return generateCode(sessions);
   return code;
killedBy: generateCode() returns exactly 6 characters
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 6
Received length: 0
Received string: ""

[Killed] EqualityOperator
src/logic.js:17:19
 function generateCode(sessions) {
   if (!sessions) sessions = new Map();
   let code = "";
-  for (let i = 0; i < 6; i++) {
+  for (let i = 0; i >= 6; i++) {
     code += VALID_CHARS[crypto.randomInt(0, VALID_CHARS.length)];
   }
killedBy: generateCode() returns exactly 6 characters
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 6
Received length: 0
Received string: ""

[Killed] AssignmentOperator
src/logic.js:18:5
   if (!sessions) sessions = new Map();
   let code = "";
   for (let i = 0; i < 6; i++) {
-    code += VALID_CHARS[crypto.randomInt(0, VALID_CHARS.length)];
+    code -= VALID_CHARS[crypto.randomInt(0, VALID_CHARS.length)];
   }
   if (sessions.has(code)) return generateCode(sessions);
killedBy: generateCode() returns exactly 6 characters
statusReason: Error: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has type:  number
Received has value: NaN

[Killed] ConditionalExpression
src/logic.js:20:7
   for (let i = 0; i < 6; i++) {
     code += VALID_CHARS[crypto.randomInt(0, VALID_CHARS.length)];
   }
-  if (sessions.has(code)) return generateCode(sessions);
+  if (true) return generateCode(sessions);
   return code;
 }
killedBy: generateCode() returns exactly 6 characters
statusReason: RangeError: Maximum call stack size exceeded

[Survived] ConditionalExpression
src/logic.js:20:7
   for (let i = 0; i < 6; i++) {
     code += VALID_CHARS[crypto.randomInt(0, VALID_CHARS.length)];
   }
-  if (sessions.has(code)) return generateCode(sessions);
+  if (false) return generateCode(sessions);
   return code;
 }

[Killed] BlockStatement
src/logic.js:25:35
 }
 
 // ── Session create validation ─────────────────────────────────────────────────
-function validateCreate(username) {
-  if (!username || username.trim().length < 2) {
-    return { error: "Name must be at least 2 characters.", status: 400 };
-  }
-  return { valid: true, username: username.trim() };
-}
+function validateCreate(username) {}
 
 // ── Session join validation ───────────────────────────────────────────────────
killedBy: validateCreate() valid username returns valid:true
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] BlockStatement
src/logic.js:26:48
 
 // ── Session create validation ─────────────────────────────────────────────────
 function validateCreate(username) {
-  if (!username || username.trim().length < 2) {
-    return { error: "Name must be at least 2 characters.", status: 400 };
-  }
+  if (!username || username.trim().length < 2) {}
   return { valid: true, username: username.trim() };
 }
killedBy: validateCreate() 1 char returns status 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: undefined

[Killed] MethodExpression
src/logic.js:26:20
 
 // ── Session create validation ─────────────────────────────────────────────────
 function validateCreate(username) {
-  if (!username || username.trim().length < 2) {
+  if (!username || username.length < 2) {
     return { error: "Name must be at least 2 characters.", status: 400 };
   }
killedBy: validateCreate() whitespace only returns status 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: undefined

[Killed] ObjectLiteral
src/logic.js:27:12
 // ── Session create validation ─────────────────────────────────────────────────
 function validateCreate(username) {
   if (!username || username.trim().length < 2) {
-    return { error: "Name must be at least 2 characters.", status: 400 };
+    return {};
   }
   return { valid: true, username: username.trim() };
killedBy: validateCreate() 1 char returns status 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: undefined

[Killed] BooleanLiteral
src/logic.js:29:19
   if (!username || username.trim().length < 2) {
     return { error: "Name must be at least 2 characters.", status: 400 };
   }
-  return { valid: true, username: username.trim() };
+  return { valid: false, username: username.trim() };
 }
 
killedBy: validateCreate() valid username returns valid:true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] MethodExpression
src/logic.js:29:35
   if (!username || username.trim().length < 2) {
     return { error: "Name must be at least 2 characters.", status: 400 };
   }
-  return { valid: true, username: username.trim() };
+  return { valid: true, username: username };
 }
 
killedBy: validateCreate() valid username is trimmed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Rohit"
Received: "  Rohit  "

[Killed] BlockStatement
src/logic.js:33:49
 }
 
 // ── Session join validation ───────────────────────────────────────────────────
-function validateJoin(sessions, username, code) {
-  const u = (username || "").trim();
-  const c = (code || "").trim().toUpperCase();
-
-  if (!u || u.length < 2) {
-    return { error: "Name must be at least 2 characters.", status: 400 };
-  }
-  if (!c) {
-    return { error: "Session code is required.", status: 400 };
-  }
-  const session = sessions.get(c);
-  if (!session) {
-    return { error: "Session not found. Check the code and try again.", status: 404 };
-  }
-  if (session.members.has(u)) {
-    return {
-      error: `"${u}" is already taken in this session. Please choose a different name.`,
-      status: 409,
-    };
-  }
- return { valid: true, username: u, code: c, session };
-}
+function validateJoin(sessions, username, code) {}
 
 // ── Summary JSON parser ───────────────────────────────────────────────────────
killedBy: validateJoin() valid new user returns valid:true
statusReason: TypeError: Cannot read properties of undefined (reading 'valid')

[Killed] MethodExpression
src/logic.js:34:13
 
 // ── Session join validation ───────────────────────────────────────────────────
 function validateJoin(sessions, username, code) {
-  const u = (username || "").trim();
+  const u = username || "";
   const c = (code || "").trim().toUpperCase();
 
killedBy: validateJoin() username trimmed
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Bob"
Received: "  Bob  "

[Killed] LogicalOperator
src/logic.js:34:14
 
 // ── Session join validation ───────────────────────────────────────────────────
 function validateJoin(sessions, username, code) {
-  const u = (username || "").trim();
+  const u = (username && "").trim();
   const c = (code || "").trim().toUpperCase();
 
killedBy: validateJoin() valid new user returns valid:true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] LogicalOperator
src/logic.js:35:14
 // ── Session join validation ───────────────────────────────────────────────────
 function validateJoin(sessions, username, code) {
   const u = (username || "").trim();
-  const c = (code || "").trim().toUpperCase();
+  const c = (code && "").trim().toUpperCase();
 
   if (!u || u.length < 2) {
killedBy: validateJoin() valid new user returns valid:true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/logic.js:35:14
 // ── Session join validation ───────────────────────────────────────────────────
 function validateJoin(sessions, username, code) {
   const u = (username || "").trim();
-  const c = (code || "").trim().toUpperCase();
+  const c = (true).trim().toUpperCase();
 
   if (!u || u.length < 2) {
killedBy: validateJoin() valid new user returns valid:true
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).trim is not a function

[Killed] ConditionalExpression
src/logic.js:37:7
   const u = (username || "").trim();
   const c = (code || "").trim().toUpperCase();
 
-  if (!u || u.length < 2) {
+  if (false) {
     return { error: "Name must be at least 2 characters.", status: 400 };
   }
killedBy: validateJoin() 1 char username returns 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: undefined

[Killed] ConditionalExpression
src/logic.js:37:13
   const u = (username || "").trim();
   const c = (code || "").trim().toUpperCase();
 
-  if (!u || u.length < 2) {
+  if (!u || false) {
     return { error: "Name must be at least 2 characters.", status: 400 };
   }
killedBy: validateJoin() 1 char username returns 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: undefined

[Killed] ObjectLiteral
src/logic.js:38:12
   const c = (code || "").trim().toUpperCase();
 
   if (!u || u.length < 2) {
-    return { error: "Name must be at least 2 characters.", status: 400 };
+    return {};
   }
   if (!c) {
killedBy: validateJoin() 1 char username returns 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: undefined

[Killed] BooleanLiteral
src/logic.js:40:7
   if (!u || u.length < 2) {
     return { error: "Name must be at least 2 characters.", status: 400 };
   }
-  if (!c) {
+  if (c) {
     return { error: "Session code is required.", status: 400 };
   }
killedBy: validateJoin() valid new user returns valid:true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/logic.js:40:7
   if (!u || u.length < 2) {
     return { error: "Name must be at least 2 characters.", status: 400 };
   }
-  if (!c) {
+  if (false) {
     return { error: "Session code is required.", status: 400 };
   }
killedBy: validateJoin() empty code returns 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] StringLiteral
src/logic.js:41:21
     return { error: "Name must be at least 2 characters.", status: 400 };
   }
   if (!c) {
-    return { error: "Session code is required.", status: 400 };
+    return { error: "", status: 400 };
   }
   const session = sessions.get(c);
killedBy: validateJoin() empty code error mentions required
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "required"
Received string:    ""

[Killed] ObjectLiteral
src/logic.js:41:12
     return { error: "Name must be at least 2 characters.", status: 400 };
   }
   if (!c) {
-    return { error: "Session code is required.", status: 400 };
+    return {};
   }
   const session = sessions.get(c);
killedBy: validateJoin() empty code returns 400
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: undefined

[Killed] BlockStatement
src/logic.js:44:17
     return { error: "Session code is required.", status: 400 };
   }
   const session = sessions.get(c);
-  if (!session) {
-    return { error: "Session not found. Check the code and try again.", status: 404 };
-  }
+  if (!session) {}
   if (session.members.has(u)) {
     return {
killedBy: validateJoin() non-existent code returns 404
statusReason: TypeError: Cannot read properties of undefined (reading 'members')

[Killed] ConditionalExpression
src/logic.js:44:7
     return { error: "Session code is required.", status: 400 };
   }
   const session = sessions.get(c);
-  if (!session) {
+  if (false) {
     return { error: "Session not found. Check the code and try again.", status: 404 };
   }
killedBy: validateJoin() non-existent code returns 404
statusReason: TypeError: Cannot read properties of undefined (reading 'members')

[Killed] StringLiteral
src/logic.js:45:21
   }
   const session = sessions.get(c);
   if (!session) {
-    return { error: "Session not found. Check the code and try again.", status: 404 };
+    return { error: "", status: 404 };
   }
   if (session.members.has(u)) {
killedBy: validateJoin() 404 error mentions not found
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "not found"
Received string:    ""

[Killed] BlockStatement
src/logic.js:47:31
   if (!session) {
     return { error: "Session not found. Check the code and try again.", status: 404 };
   }
-  if (session.members.has(u)) {
-    return {
-      error: `"${u}" is already taken in this session. Please choose a different name.`,
-      status: 409,
-    };
-  }
+  if (session.members.has(u)) {}
  return { valid: true, username: u, code: c, session };
 }
killedBy: validateJoin() duplicate username returns 409
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: undefined

[Killed] ConditionalExpression
src/logic.js:47:7
   if (!session) {
     return { error: "Session not found. Check the code and try again.", status: 404 };
   }
-  if (session.members.has(u)) {
+  if (true) {
     return {
       error: `"${u}" is already taken in this session. Please choose a different name.`,
killedBy: validateJoin() valid new user returns valid:true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ObjectLiteral
src/logic.js:48:12
     return { error: "Session not found. Check the code and try again.", status: 404 };
   }
   if (session.members.has(u)) {
-    return {
-      error: `"${u}" is already taken in this session. Please choose a different name.`,
-      status: 409,
-    };
+    return {};
   }
  return { valid: true, username: u, code: c, session };
killedBy: validateJoin() duplicate username returns 409
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 409
Received: undefined

[Killed] BooleanLiteral
src/logic.js:53:18
       status: 409,
     };
   }
- return { valid: true, username: u, code: c, session };
+ return { valid: false, username: u, code: c, session };
 }
 
killedBy: validateJoin() valid new user returns valid:true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/logic.js:57:32
 }
 
 // ── Summary JSON parser ───────────────────────────────────────────────────────
-function parseSummaryJSON(raw) {
-  try {
-    const parsed = JSON.parse(raw);
-    return {
-      title: parsed.title || "Chat Summary",
-      overview: parsed.overview || "",
-      bullets: Array.isArray(parsed.bullets) ? parsed.bullets : [],
-    };
-  } catch {
-    return { title: "Summary", overview: raw, bullets: [] };
-  }
-}
+function parseSummaryJSON(raw) {}
 
 // ── Transcript builder ────────────────────────────────────────────────────────
killedBy: parseSummaryJSON() parses all fields correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"bullets": ["a"], "overview": "O", "title": "T"}
Received: undefined

[Killed] BlockStatement
src/logic.js:58:7
 
 // ── Summary JSON parser ───────────────────────────────────────────────────────
 function parseSummaryJSON(raw) {
-  try {
-    const parsed = JSON.parse(raw);
-    return {
-      title: parsed.title || "Chat Summary",
-      overview: parsed.overview || "",
-      bullets: Array.isArray(parsed.bullets) ? parsed.bullets : [],
-    };
-  } catch {
+  try {} catch {
     return { title: "Summary", overview: raw, bullets: [] };
   }
killedBy: parseSummaryJSON() parses all fields correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"bullets": ["a"], "overview": "O", "title": "T"}
Received: undefined

[Killed] ConditionalExpression
src/logic.js:61:14
   try {
     const parsed = JSON.parse(raw);
     return {
-      title: parsed.title || "Chat Summary",
+      title: false,
       overview: parsed.overview || "",
       bullets: Array.isArray(parsed.bullets) ? parsed.bullets : [],
killedBy: parseSummaryJSON() parses all fields correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "bullets": Array [
      "a",

[Killed] ConditionalExpression
src/logic.js:61:14
   try {
     const parsed = JSON.parse(raw);
     return {
-      title: parsed.title || "Chat Summary",
+      title: true,
       overview: parsed.overview || "",
       bullets: Array.isArray(parsed.bullets) ? parsed.bullets : [],
killedBy: parseSummaryJSON() parses all fields correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "bullets": Array [
      "a",

[Killed] ConditionalExpression
src/logic.js:62:17
     const parsed = JSON.parse(raw);
     return {
       title: parsed.title || "Chat Summary",
-      overview: parsed.overview || "",
+      overview: true,
       bullets: Array.isArray(parsed.bullets) ? parsed.bullets : [],
     };
killedBy: parseSummaryJSON() parses all fields correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "bullets": Array [
      "a",

[Killed] ConditionalExpression
src/logic.js:62:17
     const parsed = JSON.parse(raw);
     return {
       title: parsed.title || "Chat Summary",
-      overview: parsed.overview || "",
+      overview: false,
       bullets: Array.isArray(parsed.bullets) ? parsed.bullets : [],
     };
killedBy: parseSummaryJSON() parses all fields correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "bullets": Array [
      "a",

[Killed] BlockStatement
src/logic.js:65:11
       overview: parsed.overview || "",
       bullets: Array.isArray(parsed.bullets) ? parsed.bullets : [],
     };
-  } catch {
-    return { title: "Summary", overview: raw, bullets: [] };
-  }
+  } catch {}
 }
 
killedBy: parseSummaryJSON() invalid JSON returns Summary title
statusReason: TypeError: Cannot read properties of undefined (reading 'title')

[Killed] BlockStatement
src/logic.js:71:36
 }
 
 // ── Transcript builder ────────────────────────────────────────────────────────
-function buildTranscript(messages) {
-  return messages
-    .slice(-50)
-    .map((m) => `${m.username}: ${m.text}`)
-    .join("\n");
-}
+function buildTranscript(messages) {}
 
 // ── Style prompt selector ─────────────────────────────────────────────────────
killedBy: buildTranscript() formats as username: text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A: hi"
Received: undefined

[Killed] MethodExpression
src/logic.js:72:10
 
 // ── Transcript builder ────────────────────────────────────────────────────────
 function buildTranscript(messages) {
-  return messages
-    .slice(-50)
+  return messages
     .map((m) => `${m.username}: ${m.text}`)
     .join("\n");
killedBy: buildTranscript() limits to last 50 of 60
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 50
Received length: 60
Received array:  ["U: 0", "U: 1", "U: 2", "U: 3", "U: 4", "U: 5", "U: 6", "U: 7", "U: 8", "U: 9", …]

[Killed] UnaryOperator
src/logic.js:73:12
 // ── Transcript builder ────────────────────────────────────────────────────────
 function buildTranscript(messages) {
   return messages
-    .slice(-50)
+    .slice(+50)
     .map((m) => `${m.username}: ${m.text}`)
     .join("\n");
killedBy: buildTranscript() formats as username: text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A: hi"
Received: ""

[Killed] ArrowFunction
src/logic.js:74:10
 function buildTranscript(messages) {
   return messages
     .slice(-50)
-    .map((m) => `${m.username}: ${m.text}`)
+    .map(() => undefined)
     .join("\n");
 }
killedBy: buildTranscript() formats as username: text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A: hi"
Received: ""

[Killed] BlockStatement
src/logic.js:79:32
 }
 
 // ── Style prompt selector ─────────────────────────────────────────────────────
-function getStylePrompt(style) {
-  const styleMap = {
-    bullets:   "Write a 1-sentence overview then exactly 3-5 concise bullet points.",
-    concise:   "Write a concise 3-4 sentence paragraph summary.",
-    tldr:      "Write a single TL;DR sentence under 25 words.",
-    decisions: "List only the decisions made in the conversation as bullet points.",
-    actions:   "List only action items and who is responsible as bullet points.",
-  };
-  return styleMap[style] || styleMap.bullets;
-}
+function getStylePrompt(style) {}
 
 // ── Auto-summarize threshold ──────────────────────────────────────────────────
killedBy: getStylePrompt() bullets contains bullet
statusReason: Error: expect(received).toContain(expected) // indexOf

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] StringLiteral
src/logic.js:82:16
 function getStylePrompt(style) {
   const styleMap = {
     bullets:   "Write a 1-sentence overview then exactly 3-5 concise bullet points.",
-    concise:   "Write a concise 3-4 sentence paragraph summary.",
+    concise:   "",
     tldr:      "Write a single TL;DR sentence under 25 words.",
     decisions: "List only the decisions made in the conversation as bullet points.",
killedBy: getStylePrompt() concise contains paragraph
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "paragraph"
Received string:    "Write a 1-sentence overview then exactly 3-5 concise bullet points."

[Killed] StringLiteral
src/logic.js:85:16
     concise:   "Write a concise 3-4 sentence paragraph summary.",
     tldr:      "Write a single TL;DR sentence under 25 words.",
     decisions: "List only the decisions made in the conversation as bullet points.",
-    actions:   "List only action items and who is responsible as bullet points.",
+    actions:   "",
   };
   return styleMap[style] || styleMap.bullets;
killedBy: getStylePrompt() actions contains action
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "action"
Received string:    "Write a 1-sentence overview then exactly 3-5 concise bullet points."

[Killed] ConditionalExpression
src/logic.js:87:10
     decisions: "List only the decisions made in the conversation as bullet points.",
     actions:   "List only action items and who is responsible as bullet points.",
   };
-  return styleMap[style] || styleMap.bullets;
+  return true;
 }
 
killedBy: getStylePrompt() bullets contains bullet
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value:   "bullet"
Received boolean: true

[Killed] LogicalOperator
src/logic.js:87:10
     decisions: "List only the decisions made in the conversation as bullet points.",
     actions:   "List only action items and who is responsible as bullet points.",
   };
-  return styleMap[style] || styleMap.bullets;
+  return styleMap[style] && styleMap.bullets;
 }
 
killedBy: getStylePrompt() concise contains paragraph
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "paragraph"
Received string:    "Write a 1-sentence overview then exactly 3-5 concise bullet points."

[Killed] BlockStatement
src/logic.js:91:40
 }
 
 // ── Auto-summarize threshold ──────────────────────────────────────────────────
-function getThreshold(autoSummarizeAt) {
-  return autoSummarizeAt || 15;
-}
+function getThreshold(autoSummarizeAt) {}
 
 // ── Effective threshold (0 = off) ─────────────────────────────────────────────
killedBy: getThreshold() undefined returns 15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: undefined

[Killed] ConditionalExpression
src/logic.js:92:10
 
 // ── Auto-summarize threshold ──────────────────────────────────────────────────
 function getThreshold(autoSummarizeAt) {
-  return autoSummarizeAt || 15;
+  return true;
 }
 
killedBy: getThreshold() undefined returns 15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: true

[Killed] ConditionalExpression
src/logic.js:92:10
 
 // ── Auto-summarize threshold ──────────────────────────────────────────────────
 function getThreshold(autoSummarizeAt) {
-  return autoSummarizeAt || 15;
+  return false;
 }
 
killedBy: getThreshold() undefined returns 15
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: false

[Killed] BlockStatement
src/logic.js:96:40
 }
 
 // ── Effective threshold (0 = off) ─────────────────────────────────────────────
-function getEffectiveThreshold(autoAt) {
-  return autoAt || 999;
-}
+function getEffectiveThreshold(autoAt) {}
 
 // ── Should trigger summary ────────────────────────────────────────────────────
killedBy: getEffectiveThreshold() 0 returns 999
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 999
Received: undefined

[Killed] ConditionalExpression
src/logic.js:97:10
 
 // ── Effective threshold (0 = off) ─────────────────────────────────────────────
 function getEffectiveThreshold(autoAt) {
-  return autoAt || 999;
+  return true;
 }
 
killedBy: getEffectiveThreshold() 0 returns 999
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 999
Received: true

[Killed] ConditionalExpression
src/logic.js:97:10
 
 // ── Effective threshold (0 = off) ─────────────────────────────────────────────
 function getEffectiveThreshold(autoAt) {
-  return autoAt || 999;
+  return false;
 }
 
killedBy: getEffectiveThreshold() 0 returns 999
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 999
Received: false

[Killed] BlockStatement
src/logic.js:101:55
 }
 
 // ── Should trigger summary ────────────────────────────────────────────────────
-function shouldTrigger(roomMsgCount, room, threshold) {
-  return (roomMsgCount[room] || 0) >= threshold;
-}
+function shouldTrigger(roomMsgCount, room, threshold) {}
 
 // ── Health response builder ───────────────────────────────────────────────────
killedBy: shouldTrigger() count equals threshold returns true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] ConditionalExpression
src/logic.js:102:10
 
 // ── Should trigger summary ────────────────────────────────────────────────────
 function shouldTrigger(roomMsgCount, room, threshold) {
-  return (roomMsgCount[room] || 0) >= threshold;
+  return true;
 }
 
killedBy: shouldTrigger() count below threshold returns false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/logic.js:102:10
 
 // ── Should trigger summary ────────────────────────────────────────────────────
 function shouldTrigger(roomMsgCount, room, threshold) {
-  return (roomMsgCount[room] || 0) >= threshold;
+  return (roomMsgCount[room] || 0) > threshold;
 }
 
killedBy: shouldTrigger() count equals threshold returns true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
