[Killed] BlockStatement
src/logic.js:106:46
 }
 
 // ── Health response builder ───────────────────────────────────────────────────
-function buildHealthResponse(model, dbState) {
-  return {
-    ok: true,
-    model,
-    db: dbState === 1 ? "connected" : "disconnected",
-  };
-}
+function buildHealthResponse(model, dbState) {}
 
 module.exports = {
killedBy: buildHealthResponse() ok is always true
statusReason: TypeError: Cannot read properties of undefined (reading 'ok')

[Killed] ObjectLiteral
src/logic.js:107:10
 
 // ── Health response builder ───────────────────────────────────────────────────
 function buildHealthResponse(model, dbState) {
-  return {
-    ok: true,
-    model,
-    db: dbState === 1 ? "connected" : "disconnected",
-  };
+  return {};
 }
 
killedBy: buildHealthResponse() ok is always true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/logic.js:108:9
 // ── Health response builder ───────────────────────────────────────────────────
 function buildHealthResponse(model, dbState) {
   return {
-    ok: true,
+    ok: false,
     model,
     db: dbState === 1 ? "connected" : "disconnected",
killedBy: buildHealthResponse() ok is always true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/logic.js:110:9
   return {
     ok: true,
     model,
-    db: dbState === 1 ? "connected" : "disconnected",
+    db: false ? "connected" : "disconnected",
   };
 }
killedBy: buildHealthResponse() readyState 1 returns connected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "connected"
Received: "disconnected"

[Killed] EqualityOperator
src/logic.js:110:9
   return {
     ok: true,
     model,
-    db: dbState === 1 ? "connected" : "disconnected",
+    db: dbState !== 1 ? "connected" : "disconnected",
   };
 }
killedBy: buildHealthResponse() readyState 1 returns connected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "connected"
Received: "disconnected"
